sid5291/RL78_uC-OSIII/EvalBoards/Renesas/YRDKRL78G14/IAR/BSP/ior5f104pj.h
#define IICRSV0           IICF0_bit.no0
#define STCEN0            IICF0_bit.no1
#define IICBSY0           IICF0_bit.no6
#define STCF0             IICF0_bit.no7

#define SPD1              IICS1_bit.no0
#define STD1              IICS1_bit.no1
#define ACKD1             IICS1_bit.no2
#define TRC1              IICS1_bit.no3
#define COI1              IICS1_bit.no4
#define EXC1              IICS1_bit.no5
#define ALD1              IICS1_bit.no6
#define MSTS1             IICS1_bit.no7

#define IICRSV1           IICF1_bit.no0
#define STCEN1            IICF1_bit.no1
#define IICBSY1           IICF1_bit.no6
#define STCF1             IICF1_bit.no7

#define RCLOE1            RTCC0_bit.no5
#define RTCE              RTCC0_bit.no7

#define RWAIT             RTCC1_bit.no0
#define RWST              RTCC1_bit.no1
#define RIFG              RTCC1_bit.no3
#define WAFG              RTCC1_bit.no4
#define WALIE             RTCC1_bit.no6
#define WALE              RTCC1_bit.no7

#define HIOSTOP           CSC_bit.no0
#define XTSTOP            CSC_bit.no6
#define MSTOP             CSC_bit.no7

#define SDIV              CKC_bit.no3
#define MCM0              CKC_bit.no4
#define MCS               CKC_bit.no5
#define CSS               CKC_bit.no6
#define CLS               CKC_bit.no7

#define PCLOE0            CKS0_bit.no7

#define PCLOE1            CKS1_bit.no7

#define LVIF              LVIM_bit.no0
#define LVIOMSK           LVIM_bit.no1
#define LVISEN            LVIM_bit.no7

#define LVILV             LVIS_bit.no0
#define LVIMD             LVIS_bit.no7

#define TMIF11            IF2L_bit.no0
#define TMIF12            IF2L_bit.no1
#define TMIF13            IF2L_bit.no2
#define PIF6              IF2L_bit.no3
#define PIF7              IF2L_bit.no4
#define PIF8              IF2L_bit.no5
#define PIF9              IF2L_bit.no6
#define CMPIF0            IF2L_bit.no7
#define PIF10             IF2L_bit.no7

#define CMPIF1            IF2H_bit.no0
#define PIF11             IF2H_bit.no0
#define TRDIF0            IF2H_bit.no1
#define TRDIF1            IF2H_bit.no2
#define TRGIF             IF2H_bit.no3
#define SREIF3            IF2H_bit.no4
#define TMIF13H           IF2H_bit.no4
#define IICAIF1           IF2H_bit.no6
#define FLIF              IF2H_bit.no7

#define TMMK11            MK2L_bit.no0
#define TMMK12            MK2L_bit.no1
#define TMMK13            MK2L_bit.no2
#define PMK6              MK2L_bit.no3
#define PMK7              MK2L_bit.no4
#define PMK8              MK2L_bit.no5
#define PMK9              MK2L_bit.no6
#define CMPMK0            MK2L_bit.no7
#define PMK10             MK2L_bit.no7

#define CMPMK1            MK2H_bit.no0
#define PMK11             MK2H_bit.no0
#define TRDMK0            MK2H_bit.no1
#define TRDMK1            MK2H_bit.no2
#define TRGMK             MK2H_bit.no3
#define SREMK3            MK2H_bit.no4
#define TMMK13H           MK2H_bit.no4
#define IICAMK1           MK2H_bit.no6
#define FLMK              MK2H_bit.no7

#define TMPR011           PR02L_bit.no0
#define TMPR012           PR02L_bit.no1
#define TMPR013           PR02L_bit.no2
#define PPR06             PR02L_bit.no3
#define PPR07             PR02L_bit.no4
#define PPR08             PR02L_bit.no5
#define PPR09             PR02L_bit.no6
#define CMPPR00           PR02L_bit.no7
#define PPR010            PR02L_bit.no7

#define CMPPR01           PR02H_bit.no0
#define PPR011            PR02H_bit.no0
#define TRDPR00           PR02H_bit.no1
#define TRDPR01           PR02H_bit.no2
#define TRGPR0            PR02H_bit.no3
#define SREPR03           PR02H_bit.no4
#define TMPR013H          PR02H_bit.no4
#define IICAPR01          PR02H_bit.no6
#define FLPR0             PR02H_bit.no7

#define TMPR111           PR12L_bit.no0
#define TMPR112           PR12L_bit.no1
#define TMPR113           PR12L_bit.no2
#define PPR16             PR12L_bit.no3
#define PPR17             PR12L_bit.no4
#define PPR18             PR12L_bit.no5
#define PPR19             PR12L_bit.no6
#define CMPPR10           PR12L_bit.no7
#define PPR110            PR12L_bit.no7

#define CMPPR11           PR12H_bit.no0
#define PPR111            PR12H_bit.no0
#define TRDPR10           PR12H_bit.no1
#define TRDPR11           PR12H_bit.no2
#define TRGPR1            PR12H_bit.no3
#define SREPR13           PR12H_bit.no4
#define TMPR113H          PR12H_bit.no4
#define IICAPR11          PR12H_bit.no6
#define FLPR1             PR12H_bit.no7

#define SROIF             IF0L_bit.no0
#define WDTIIF            IF0L_bit.no0
#define LVIIF             IF0L_bit.no1
#define PIF0              IF0L_bit.no2
#define PIF1              IF0L_bit.no3
#define PIF2              IF0L_bit.no4
#define PIF3              IF0L_bit.no5
#define PIF4              IF0L_bit.no6
#define PIF5              IF0L_bit.no7

#define CSIIF20           IF0H_bit.no0
#define IICIF20           IF0H_bit.no0
#define STIF2             IF0H_bit.no0
#define CSIIF21           IF0H_bit.no1
#define IICIF21           IF0H_bit.no1
#define SRIF2             IF0H_bit.no1
#define SREIF2            IF0H_bit.no2
#define TMIF11H           IF0H_bit.no2
#define CSIIF00           IF0H_bit.no5
#define IICIF00           IF0H_bit.no5
#define STIF0             IF0H_bit.no5
#define CSIIF01           IF0H_bit.no6
#define IICIF01           IF0H_bit.no6
#define SRIF0             IF0H_bit.no6
#define SREIF0            IF0H_bit.no7
#define TMIF01H           IF0H_bit.no7

#define CSIIF10           IF1L_bit.no0
#define IICIF10           IF1L_bit.no0
#define STIF1             IF1L_bit.no0
#define CSIIF11           IF1L_bit.no1
#define IICIF11           IF1L_bit.no1
#define SRIF1             IF1L_bit.no1
#define SREIF1            IF1L_bit.no2
#define TMIF03H           IF1L_bit.no2
#define IICAIF0           IF1L_bit.no3
#define TMIF00            IF1L_bit.no4
#define TMIF01            IF1L_bit.no5
#define TMIF02            IF1L_bit.no6
#define TMIF03            IF1L_bit.no7

#define ADIF              IF1H_bit.no0
#define RTCIF             IF1H_bit.no1
#define ITIF              IF1H_bit.no2
#define KRIF              IF1H_bit.no3
#define CSIIF30           IF1H_bit.no4
#define IICIF30           IF1H_bit.no4
#define STIF3             IF1H_bit.no4
#define CSIIF31           IF1H_bit.no5
#define IICIF31           IF1H_bit.no5
#define SRIF3             IF1H_bit.no5
#define TRJIF0            IF1H_bit.no6
#define TMIF10            IF1H_bit.no7

#define SROMK             MK0L_bit.no0
#define WDTIMK            MK0L_bit.no0
#define LVIMK             MK0L_bit.no1
#define PMK0              MK0L_bit.no2
#define PMK1              MK0L_bit.no3
#define PMK2              MK0L_bit.no4
#define PMK3              MK0L_bit.no5
#define PMK4              MK0L_bit.no6
#define PMK5              MK0L_bit.no7

