sid5291/RL78_uC-OSIII/EvalBoards/Renesas/YRDKRL78G14/IAR/BSP/ior5f104pj.h
#define CSIMK20           MK0H_bit.no0
#define IICMK20           MK0H_bit.no0
#define STMK2             MK0H_bit.no0
#define CSIMK21           MK0H_bit.no1
#define IICMK21           MK0H_bit.no1
#define SRMK2             MK0H_bit.no1
#define SREMK2            MK0H_bit.no2
#define TMMK11H           MK0H_bit.no2
#define CSIMK00           MK0H_bit.no5
#define IICMK00           MK0H_bit.no5
#define STMK0             MK0H_bit.no5
#define CSIMK01           MK0H_bit.no6
#define IICMK01           MK0H_bit.no6
#define SRMK0             MK0H_bit.no6
#define SREMK0            MK0H_bit.no7
#define TMMK01H           MK0H_bit.no7

#define CSIMK10           MK1L_bit.no0
#define IICMK10           MK1L_bit.no0
#define STMK1             MK1L_bit.no0
#define CSIMK11           MK1L_bit.no1
#define IICMK11           MK1L_bit.no1
#define SRMK1             MK1L_bit.no1
#define SREMK1            MK1L_bit.no2
#define TMMK03H           MK1L_bit.no2
#define IICAMK0           MK1L_bit.no3
#define TMMK00            MK1L_bit.no4
#define TMMK01            MK1L_bit.no5
#define TMMK02            MK1L_bit.no6
#define TMMK03            MK1L_bit.no7

#define ADMK              MK1H_bit.no0
#define RTCMK             MK1H_bit.no1
#define ITMK              MK1H_bit.no2
#define KRMK              MK1H_bit.no3
#define CSIMK30           MK1H_bit.no4
#define IICMK30           MK1H_bit.no4
#define STMK3             MK1H_bit.no4
#define CSIMK31           MK1H_bit.no5
#define IICMK31           MK1H_bit.no5
#define SRMK3             MK1H_bit.no5
#define TRJMK0            MK1H_bit.no6
#define TMMK10            MK1H_bit.no7

#define SROPR0            PR00L_bit.no0
#define WDTIPR0           PR00L_bit.no0
#define LVIPR0            PR00L_bit.no1
#define PPR00             PR00L_bit.no2
#define PPR01             PR00L_bit.no3
#define PPR02             PR00L_bit.no4
#define PPR03             PR00L_bit.no5
#define PPR04             PR00L_bit.no6
#define PPR05             PR00L_bit.no7

#define CSIPR020          PR00H_bit.no0
#define IICPR020          PR00H_bit.no0
#define STPR02            PR00H_bit.no0
#define CSIPR021          PR00H_bit.no1
#define IICPR021          PR00H_bit.no1
#define SRPR02            PR00H_bit.no1
#define SREPR02           PR00H_bit.no2
#define TMPR011H          PR00H_bit.no2
#define CSIPR000          PR00H_bit.no5
#define IICPR000          PR00H_bit.no5
#define STPR00            PR00H_bit.no5
#define CSIPR001          PR00H_bit.no6
#define IICPR001          PR00H_bit.no6
#define SRPR00            PR00H_bit.no6
#define SREPR00           PR00H_bit.no7
#define TMPR001H          PR00H_bit.no7

#define CSIPR010          PR01L_bit.no0
#define IICPR010          PR01L_bit.no0
#define STPR01            PR01L_bit.no0
#define CSIPR011          PR01L_bit.no1
#define IICPR011          PR01L_bit.no1
#define SRPR01            PR01L_bit.no1
#define SREPR01           PR01L_bit.no2
#define TMPR003H          PR01L_bit.no2
#define IICAPR00          PR01L_bit.no3
#define TMPR000           PR01L_bit.no4
#define TMPR001           PR01L_bit.no5
#define TMPR002           PR01L_bit.no6
#define TMPR003           PR01L_bit.no7

#define ADPR0             PR01H_bit.no0
#define RTCPR0            PR01H_bit.no1
#define ITPR0             PR01H_bit.no2
#define KRPR0             PR01H_bit.no3
#define CSIPR030          PR01H_bit.no4
#define IICPR030          PR01H_bit.no4
#define STPR03            PR01H_bit.no4
#define CSIPR031          PR01H_bit.no5
#define IICPR031          PR01H_bit.no5
#define SRPR03            PR01H_bit.no5
#define TRJPR00           PR01H_bit.no6
#define TMPR010           PR01H_bit.no7

#define SROPR1            PR10L_bit.no0
#define WDTIPR1           PR10L_bit.no0
#define LVIPR1            PR10L_bit.no1
#define PPR10             PR10L_bit.no2
#define PPR11             PR10L_bit.no3
#define PPR12             PR10L_bit.no4
#define PPR13             PR10L_bit.no5
#define PPR14             PR10L_bit.no6
#define PPR15             PR10L_bit.no7

#define CSIPR120          PR10H_bit.no0
#define IICPR120          PR10H_bit.no0
#define STPR12            PR10H_bit.no0
#define CSIPR121          PR10H_bit.no1
#define IICPR121          PR10H_bit.no1
#define SRPR12            PR10H_bit.no1
#define SREPR12           PR10H_bit.no2
#define TMPR111H          PR10H_bit.no2
#define CSIPR100          PR10H_bit.no5
#define IICPR100          PR10H_bit.no5
#define STPR10            PR10H_bit.no5
#define CSIPR101          PR10H_bit.no6
#define IICPR101          PR10H_bit.no6
#define SRPR10            PR10H_bit.no6
#define SREPR10           PR10H_bit.no7
#define TMPR101H          PR10H_bit.no7

#define CSIPR110          PR11L_bit.no0
#define IICPR110          PR11L_bit.no0
#define STPR11            PR11L_bit.no0
#define CSIPR111          PR11L_bit.no1
#define IICPR111          PR11L_bit.no1
#define SRPR11            PR11L_bit.no1
#define SREPR11           PR11L_bit.no2
#define TMPR103H          PR11L_bit.no2
#define IICAPR10          PR11L_bit.no3
#define TMPR100           PR11L_bit.no4
#define TMPR101           PR11L_bit.no5
#define TMPR102           PR11L_bit.no6
#define TMPR103           PR11L_bit.no7

#define ADPR1             PR11H_bit.no0
#define RTCPR1            PR11H_bit.no1
#define ITPR1             PR11H_bit.no2
#define KRPR1             PR11H_bit.no3
#define CSIPR130          PR11H_bit.no4
#define IICPR130          PR11H_bit.no4
#define STPR13            PR11H_bit.no4
#define CSIPR131          PR11H_bit.no5
#define IICPR131          PR11H_bit.no5
#define SRPR13            PR11H_bit.no5
#define TRJPR10           PR11H_bit.no6
#define TMPR110           PR11H_bit.no7

#define MAA               PMC_bit.no0

#pragma language=restore

#endif /* __IAR_SYSTEMS_ICC__ */

#ifdef __IAR_SYSTEMS_ASM__

/*----------------------------------------------
 *       SFR declarations
 *--------------------------------------------*/

P0         DEFINE  0xFFF00
P1         DEFINE  0xFFF01
P2         DEFINE  0xFFF02
P3         DEFINE  0xFFF03
P4         DEFINE  0xFFF04
P5         DEFINE  0xFFF05
P6         DEFINE  0xFFF06
P7         DEFINE  0xFFF07
P8         DEFINE  0xFFF08
P10        DEFINE  0xFFF0A
P11        DEFINE  0xFFF0B
P12        DEFINE  0xFFF0C
P13        DEFINE  0xFFF0D
P14        DEFINE  0xFFF0E
P15        DEFINE  0xFFF0F
SDR00      DEFINE  0xFFF10
SIO00      DEFINE  0xFFF10
TXD0       DEFINE  0xFFF10
SDR01      DEFINE  0xFFF12
RXD0       DEFINE  0xFFF12
SIO01      DEFINE  0xFFF12
SDR12      DEFINE  0xFFF14
SIO30      DEFINE  0xFFF14
TXD3       DEFINE  0xFFF14
SDR13      DEFINE  0xFFF16
RXD3       DEFINE  0xFFF16
SIO31      DEFINE  0xFFF16
TDR00      DEFINE  0xFFF18
TDR01      DEFINE  0xFFF1A
TDR01L     DEFINE  0xFFF1A
TDR01H     DEFINE  0xFFF1B
ADCR       DEFINE  0xFFF1E
ADCRH      DEFINE  0xFFF1F
PM0        DEFINE  0xFFF20
PM1        DEFINE  0xFFF21
PM2        DEFINE  0xFFF22
PM3        DEFINE  0xFFF23
PM4        DEFINE  0xFFF24
PM5        DEFINE  0xFFF25
PM6        DEFINE  0xFFF26
PM7        DEFINE  0xFFF27
PM8        DEFINE  0xFFF28
PM10       DEFINE  0xFFF2A
PM11       DEFINE  0xFFF2B
PM12       DEFINE  0xFFF2C
PM14       DEFINE  0xFFF2E
PM15       DEFINE  0xFFF2F
ADM0       DEFINE  0xFFF30
ADS        DEFINE  0xFFF31
ADM1       DEFINE  0xFFF32
DACS0      DEFINE  0xFFF34
DACS1      DEFINE  0xFFF35
DAM        DEFINE  0xFFF36
KRM        DEFINE  0xFFF37
EGP0       DEFINE  0xFFF38
EGN0       DEFINE  0xFFF39
EGP1       DEFINE  0xFFF3A
EGN1       DEFINE  0xFFF3B
SDR02      DEFINE  0xFFF44
SIO10      DEFINE  0xFFF44
TXD1       DEFINE  0xFFF44
SDR03      DEFINE  0xFFF46
RXD1       DEFINE  0xFFF46
SIO11      DEFINE  0xFFF46
SDR10      DEFINE  0xFFF48
SIO20      DEFINE  0xFFF48
TXD2       DEFINE  0xFFF48
SDR11      DEFINE  0xFFF4A
RXD2       DEFINE  0xFFF4A
SIO21      DEFINE  0xFFF4A
IICA0      DEFINE  0xFFF50
IICS0      DEFINE  0xFFF51
IICF0      DEFINE  0xFFF52
IICA1      DEFINE  0xFFF54
IICS1      DEFINE  0xFFF55
IICF1      DEFINE  0xFFF56
TRDGRC0    DEFINE  0xFFF58
TRDGRD0    DEFINE  0xFFF5A
TRDGRC1    DEFINE  0xFFF5C
TRDGRD1    DEFINE  0xFFF5E
TRGGRC     DEFINE  0xFFF60
TRGGRD     DEFINE  0xFFF62
TDR02      DEFINE  0xFFF64
TDR03      DEFINE  0xFFF66
TDR03L     DEFINE  0xFFF66
TDR03H     DEFINE  0xFFF67
TDR10      DEFINE  0xFFF70
TDR11      DEFINE  0xFFF72
TDR11L     DEFINE  0xFFF72
TDR11H     DEFINE  0xFFF73
TDR12      DEFINE  0xFFF74
TDR13      DEFINE  0xFFF76
TDR13L     DEFINE  0xFFF76
TDR13H     DEFINE  0xFFF77
ITMC       DEFINE  0xFFF90
SEC        DEFINE  0xFFF92
MIN        DEFINE  0xFFF93
HOUR       DEFINE  0xFFF94
WEEK       DEFINE  0xFFF95
DAY        DEFINE  0xFFF96
MONTH      DEFINE  0xFFF97
YEAR       DEFINE  0xFFF98
SUBCUD     DEFINE  0xFFF99
ALARMWM    DEFINE  0xFFF9A
ALARMWH    DEFINE  0xFFF9B
ALARMWW    DEFINE  0xFFF9C
RTCC0      DEFINE  0xFFF9D
RTCC1      DEFINE  0xFFF9E
CMC        DEFINE  0xFFFA0
CSC        DEFINE  0xFFFA1
OSTC       DEFINE  0xFFFA2
OSTS       DEFINE  0xFFFA3
CKC        DEFINE  0xFFFA4
CKS0       DEFINE  0xFFFA5
CKS1       DEFINE  0xFFFA6
RESF       DEFINE  0xFFFA8
LVIM       DEFINE  0xFFFA9
LVIS       DEFINE  0xFFFAA
WDTE       DEFINE  0xFFFAB
CRCIN      DEFINE  0xFFFAC
IF2        DEFINE  0xFFFD0
IF2L       DEFINE  0xFFFD0
IF2H       DEFINE  0xFFFD1
MK2        DEFINE  0xFFFD4
MK2L       DEFINE  0xFFFD4
MK2H       DEFINE  0xFFFD5
PR02       DEFINE  0xFFFD8
PR02L      DEFINE  0xFFFD8
PR02H      DEFINE  0xFFFD9
PR12       DEFINE  0xFFFDC
PR12L      DEFINE  0xFFFDC
PR12H      DEFINE  0xFFFDD
IF0        DEFINE  0xFFFE0
IF0L       DEFINE  0xFFFE0
IF0H       DEFINE  0xFFFE1
IF1        DEFINE  0xFFFE2
IF1L       DEFINE  0xFFFE2
IF1H       DEFINE  0xFFFE3
MK0        DEFINE  0xFFFE4
MK0L       DEFINE  0xFFFE4
MK0H       DEFINE  0xFFFE5
MK1        DEFINE  0xFFFE6
MK1L       DEFINE  0xFFFE6
MK1H       DEFINE  0xFFFE7
PR00       DEFINE  0xFFFE8
PR00L      DEFINE  0xFFFE8
PR00H      DEFINE  0xFFFE9
PR01       DEFINE  0xFFFEA
PR01L      DEFINE  0xFFFEA
PR01H      DEFINE  0xFFFEB
PR10       DEFINE  0xFFFEC
PR10L      DEFINE  0xFFFEC
PR10H      DEFINE  0xFFFED
PR11       DEFINE  0xFFFEE
PR11L      DEFINE  0xFFFEE
PR11H      DEFINE  0xFFFEF
PMC        DEFINE  0xFFFFE

#endif /* __IAR_SYSTEMS_ASM__ */

/*----------------------------------------------
 *       Interrupt vector addresses
 *--------------------------------------------*/

#define RST_vect                 (0x00)
#define INTDBG_vect              (0x02)
#define INTSRO_vect              (0x04)
#define INTWDTI_vect             (0x04)
#define INTLVI_vect              (0x06)
#define INTP0_vect               (0x08)
#define INTP1_vect               (0x0A)
#define INTP2_vect               (0x0C)
#define INTP3_vect               (0x0E)
#define INTP4_vect               (0x10)
#define INTP5_vect               (0x12)
#define INTCSI20_vect            (0x14)
#define INTIIC20_vect            (0x14)
#define INTST2_vect              (0x14)
#define INTCSI21_vect            (0x16)
#define INTIIC21_vect            (0x16)
#define INTSR2_vect              (0x16)
#define INTSRE2_vect             (0x18)
#define INTTM11H_vect            (0x18)
#define INTCSI00_vect            (0x1E)
#define INTIIC00_vect            (0x1E)
#define INTST0_vect              (0x1E)
#define INTCSI01_vect            (0x20)
#define INTIIC01_vect            (0x20)
#define INTSR0_vect              (0x20)
#define INTSRE0_vect             (0x22)
#define INTTM01H_vect            (0x22)
#define INTCSI10_vect            (0x24)
#define INTIIC10_vect            (0x24)
#define INTST1_vect              (0x24)
#define INTCSI11_vect            (0x26)
#define INTIIC11_vect            (0x26)
#define INTSR1_vect              (0x26)
#define INTSRE1_vect             (0x28)
#define INTTM03H_vect            (0x28)
#define INTIICA0_vect            (0x2A)
#define INTTM00_vect             (0x2C)
#define INTTM01_vect             (0x2E)
#define INTTM02_vect             (0x30)
#define INTTM03_vect             (0x32)
#define INTAD_vect               (0x34)
#define INTRTC_vect              (0x36)
#define INTIT_vect               (0x38)
#define INTKR_vect               (0x3A)
#define INTCSI30_vect            (0x3C)
#define INTIIC30_vect            (0x3C)
#define INTST3_vect              (0x3C)
#define INTCSI31_vect            (0x3E)
#define INTIIC31_vect            (0x3E)
#define INTSR3_vect              (0x3E)
#define INTTRJ0_vect             (0x40)
#define INTTM10_vect             (0x42)
#define INTTM11_vect             (0x44)
#define INTTM12_vect             (0x46)
#define INTTM13_vect             (0x48)
#define INTP6_vect               (0x4A)
#define INTP7_vect               (0x4C)
#define INTP8_vect               (0x4E)
#define INTP9_vect               (0x50)
#define INTCMP0_vect             (0x52)
#define INTP10_vect              (0x52)
#define INTCMP1_vect             (0x54)
#define INTP11_vect              (0x54)
#define INTTRD0_vect             (0x56)
#define INTTRD1_vect             (0x58)
#define INTTRG_vect              (0x5A)
#define INTSRE3_vect             (0x5C)
#define INTTM13H_vect            (0x5C)
#define INTIICA1_vect            (0x60)
#define INTFL_vect               (0x62)
#define BRK_I_vect               (0x7E)

/*----------------------------------------------
 *       Callt vector addresses
 *--------------------------------------------*/

#define CALLT_80_vect            (0x80)
#define CALLT_82_vect            (0x82)
#define CALLT_84_vect            (0x84)
#define CALLT_86_vect            (0x86)
#define CALLT_88_vect            (0x88)
#define CALLT_8A_vect            (0x8A)
#define CALLT_8C_vect            (0x8C)
#define CALLT_8E_vect            (0x8E)
#define CALLT_90_vect            (0x90)
#define CALLT_92_vect            (0x92)
#define CALLT_94_vect            (0x94)
#define CALLT_96_vect            (0x96)
#define CALLT_98_vect            (0x98)
#define CALLT_9A_vect            (0x9A)
#define CALLT_9C_vect            (0x9C)
#define CALLT_9E_vect            (0x9E)
#define CALLT_A0_vect            (0xA0)
#define CALLT_A2_vect            (0xA2)
#define CALLT_A4_vect            (0xA4)
#define CALLT_A6_vect            (0xA6)
#define CALLT_A8_vect            (0xA8)
#define CALLT_AA_vect            (0xAA)
#define CALLT_AC_vect            (0xAC)
#define CALLT_AE_vect            (0xAE)
#define CALLT_B0_vect            (0xB0)
#define CALLT_B2_vect            (0xB2)
#define CALLT_B4_vect            (0xB4)
#define CALLT_B6_vect            (0xB6)
#define CALLT_B8_vect            (0xB8)
#define CALLT_BA_vect            (0xBA)
#define CALLT_BC_vect            (0xBC)
#define CALLT_BE_vect            (0xBE)

#endif /* __IOR5F104PJ_H__ */
